---
kind: type
id: T:Autodesk.Revit.DB.Blend
source: html/6875edf6-f0ba-60bc-f294-21bb689c5994.htm
---
# Autodesk.Revit.DB.Blend

A blend solid or void form.

## Syntax (C#)
```csharp
public class Blend : GenericForm
```